#!/usr/bin/env python3
"""
Публичный Telegram бот для GhostCopywriter (версия 2)

Этот бот предназначен для публичного использования и:
- Показывает оферту и политику конфиденциальности перед началом работы
- Приглашает пользователей написать в личку для получения доступа
- Не выдает токены автоматически (только через личную переписку)

Использование:
1. Создайте второго бота у @BotFather
2. Укажите TELEGRAM_BOT_TOKEN_PUBLIC в .env
3. Запустите: python bot_public.py
"""

import os
import sys
import logging
from datetime import datetime
from dotenv import load_dotenv
from telegram import Update, InlineKeyboardButton, InlineKeyboardMarkup
from telegram.ext import Application, CommandHandler, CallbackQueryHandler, ContextTypes
from telegram.constants import ParseMode

# Загрузка переменных окружения
load_dotenv()

# Настройка логирования
logging.basicConfig(
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
    level=logging.INFO
)
logger = logging.getLogger(__name__)

# Настройки
BOT_TOKEN = os.getenv('TELEGRAM_BOT_TOKEN_PUBLIC')
OWNER_USERNAME = os.getenv('OWNER_TELEGRAM', '@rain511')  # Telegram разработчика для бета-тестирования

if not BOT_TOKEN:
    logger.error("❌ TELEGRAM_BOT_TOKEN_PUBLIC не установлен в .env файле!")
    sys.exit(1)

# =============================================================================
# ТЕКСТЫ ОФЕРТЫ И ПОЛИТИКИ
# =============================================================================

OFFER_PART_1 = """
<b>📜 Публичная оферта GhostCopywriter</b>

Физическое лицо <b>Лавров Артем Сергеевич</b>, именуемое далее <i>Исполнитель</i>, предлагает неограниченному кругу лиц (Пользователям) заключить публичный договор на условиях нижеприведенной оферты.

<b>1. Предмет оферты</b>
1.1. Исполнитель предоставляет доступ к бета-версии веб-приложения <b>GhostCopywriter</b> — сервису генерации текстового контента для социальных сетей.
1.2. Доступ осуществляется через Telegram-бот, предназначенный исключительно для покупки подписки и получения ссылки на веб-приложение.
1.3. Услуги предоставляются <b>бесплатно</b> в рамках бета-тестирования до выхода стабильной версии.
1.4. История всех сессий автоматически удаляется из базы данных через 50 минут после завершения.
"""

OFFER_PART_2 = """
<b>2. Порядок акцепта</b>
2.1. Акцептом оферты считается:
   • оплата подписки через Telegram-бот;
   • вход в веб-приложение по полученной ссылке.
2.2. Дальнейшее использование сервиса подтверждает полное согласие с офертой.

<b>3. Права и обязанности</b>
3.1. Пользователь вправе: тестировать функционал, использовать сгенерированный контент в своих соцсетях.
3.2. Пользователю запрещено: копировать исходный код, распространять доступ, использовать в коммерческих целях без отдельного договора.
3.3. Исполнитель не гарантирует бесперебойную работу бета-версии и не несет ответственности за сбои.
"""

OFFER_PART_3 = """
<b>4. Ответственность сторон</b>
4.1. Максимальная ответственность Исполнителя — 0 (ноль) рублей, так как услуги бесплатны.
4.2. Пользователь самостоятельно отвечает за использование сгенерированного контента.

<b>5. Срок действия и расторжение</b>
5.1. Оферта действует до удаления сервиса или уведомления пользователей.
5.2. Споры рассматриваются в суде по месту регистрации Исполнителя [Россия].

<b>Реквизиты:</b>
Лавров Артем Сергеевич
Telegram: {owner_username}
<i>Дата публикации: 12 января 2026 г.</i>
"""

PRIVACY_POLICY = """
<b>🔒 Политика конфиденциальности GhostCopywriter</b>

<b>1. Какие данные обрабатываются</b>
• Сервис <b>не собирает и не хранит персональные данные</b>
• Оператором ПДн по 152-ФЗ Исполнитель не является
• Временные логи сессий хранятся 50 минут, затем безвозвратно удаляются
• Telegram ID используется только для выдачи ссылки, не сохраняется
• IP-адреса не фиксируются
• Метрики анонимизированы (без привязки к пользователю)

<b>2. Цели обработки данных</b>
• Обеспечение работы бета-версии
• Выявление технических ошибок

Данные не передаются третьим лицам, не используются для маркетинга или профилирования.

<b>3. Права пользователя</b>
Просмотр/удаление данных невозможны из-за автоматического удаления через 50 минут. При завершении бета-теста база данных полностью очищается.

<b>4. Telegram-бот</b>
Бот обрабатывает только платежи за подписку и выдает ссылку на веб-приложение. История взаимодействий также удаляется через 50 минут.

<b>5. Изменения политики</b>
Исполнитель вправе обновить документ с уведомлением в боте. Продолжение использования = согласие с изменениями.

<i>Дата: 12 января 2026 г.</i>
Контакты: {owner_username}
"""

# =============================================================================
# SEO-ОПТИМИЗИРОВАННЫЕ ТЕКСТЫ
# =============================================================================

DEMO_INVITATION_TEXT = """
🎯 <b>Хотите протестировать GhostCopywriter БЕСПЛАТНО?</b>

<b>GhostCopywriter</b> — это ваш личный AI-копирайтер, который создаёт профессиональный контент для соцсетей за секунды!

<b>✨ Что вы получаете с DEMO-доступом:</b>
✅ <b>7 дней</b> полного доступа к платформе
✅ <b>Безлимитные генерации</b> — создавайте сколько угодно!
✅ <b>Поддержка 8+ платформ:</b> VK, Дзен, Telegram, TikTok, Instagram, Facebook, Twitter, LinkedIn
✅ <b>AI-генерация изображений</b> к каждому посту
✅ <b>Гибкая настройка:</b> тон, стиль, цель, эмоции, CTA
✅ <b>SEO-оптимизация</b> текстов автоматически

<b>🔥 Почему GhostCopywriter?</b>
• Экономия времени: создавайте пост за 30 секунд вместо 30 минут
• Профессиональное качество: тексты как от опытного копирайтера
• Уникальность: каждый текст создаётся с нуля
• Без регистрации: получаете ссылку и сразу начинаете работать

<b>💡 Идеально для:</b>
→ SMM-специалистов и маркетологов
→ Предпринимателей и владельцев бизнеса
→ Контент-менеджеров и блогеров
→ Фрилансеров и агентств

<b>🧪 БЕТА-ТЕСТИРОВАНИЕ</b>

Сейчас проект находится в режиме бета-теста. Я лично выдаю DEMO-токены первым пользователям!

<b>🎁 Как получить DEMO-доступ:</b>
Напишите мне в личку {owner_username} со словом <b>"ДЕМО"</b>, и я вышлю вам персональную ссылку для доступа!

<i>⏱ Обычно отвечаю в течение часа в рабочее время (10:00-22:00 МСК)</i>
"""

SUBSCRIPTION_INVITATION_TEXT = """
💎 <b>Заинтересовались полной версией GhostCopywriter?</b>

<b>🧪 Сейчас проект в режиме бета-теста!</b>

Тарифы и платная подписка находятся в разработке. Но вы уже можете получить расширенный доступ!

<b>🚀 Что будет в PRO-версии:</b>
✅ <b>Постоянный доступ</b> — без временных ограничений
✅ <b>Приоритетная поддержка</b> — ваши вопросы решаются первыми
✅ <b>Эксклюзивные функции:</b> шаблоны, сохранение настроек, история генераций
✅ <b>Расширенная AI-модель</b> — ещё более качественные тексты
✅ <b>API доступ</b> для интеграции в ваши системы

<b>🎁 Специально для бета-тестеров:</b>
• Бесплатный расширенный DEMO-доступ
• Возможность повлиять на развитие сервиса
• Скидка при запуске платной версии

<b>💬 Хотите участвовать в бета-тесте?</b>

Напишите мне в личку {owner_username} — расскажите о себе и своих задачах, и я предоставлю вам расширенный доступ!

<i>Ваша обратная связь очень важна для развития проекта! 🙏</i>
"""

AFTER_OFFER_ACCEPTANCE = """
✅ <b>Отлично! Вы приняли условия оферты.</b>

Теперь вы можете:

🆓 <b>Получить DEMO-доступ</b> (7 дней, безлимит)
💎 <b>Оформить подписку</b> (постоянный доступ)

Выберите действие ниже 👇
"""

# =============================================================================
# ОБРАБОТЧИКИ КОМАНД
# =============================================================================

async def start_command(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    """
    Обработчик команды /start
    Показывает оферту перед началом работы
    """
    user = update.effective_user
    logger.info(f"Пользователь {user.id} запустил команду /start")
    
    # Отправляем оферту по частям
    await update.message.reply_html(OFFER_PART_1)
    await update.message.reply_html(OFFER_PART_2)
    await update.message.reply_html(
        OFFER_PART_3.format(owner_username=OWNER_USERNAME)
    )
    
    # Отправляем политику конфиденциальности
    await update.message.reply_html(
        PRIVACY_POLICY.format(owner_username=OWNER_USERNAME)
    )
    
    # Кнопка принятия оферты
    keyboard = [
        [InlineKeyboardButton("✅ Принимаю условия", callback_data='accept_offer')],
        [InlineKeyboardButton("❌ Отклонить", callback_data='decline_offer')]
    ]
    reply_markup = InlineKeyboardMarkup(keyboard)
    
    await update.message.reply_html(
        "<b>📋 Пожалуйста, ознакомьтесь с условиями выше.</b>\n\n"
        "Продолжая использование сервиса, вы подтверждаете согласие с публичной офертой "
        "и политикой конфиденциальности.",
        reply_markup=reply_markup
    )


async def button_callback(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    """Обработчик нажатий на inline кнопки"""
    query = update.callback_query
    await query.answer()
    
    user = query.from_user
    action = query.data
    
    logger.info(f"Пользователь {user.id} нажал кнопку: {action}")
    
    if action == 'accept_offer':
        # Пользователь принял оферту
        keyboard = [
            [InlineKeyboardButton("🆓 Получить DEMO-доступ", callback_data='get_demo')],
            [InlineKeyboardButton("💎 Оформить подписку", callback_data='buy_subscription')],
            [InlineKeyboardButton("ℹ️ О сервисе", callback_data='about_service')]
        ]
        reply_markup = InlineKeyboardMarkup(keyboard)
        
        await query.edit_message_text(
            text=AFTER_OFFER_ACCEPTANCE,
            parse_mode=ParseMode.HTML,
            reply_markup=reply_markup
        )
    
    elif action == 'decline_offer':
        # Пользователь отклонил оферту
        await query.edit_message_text(
            text="😔 <b>Жаль, что вы отклонили условия.</b>\n\n"
                 "Без принятия оферты мы не можем предоставить доступ к сервису.\n\n"
                 "Если передумаете — нажмите /start снова.",
            parse_mode=ParseMode.HTML
        )
    
    elif action == 'get_demo':
        # Приглашение получить DEMO в личке
        keyboard = [
            [InlineKeyboardButton(f"✉️ Написать {OWNER_USERNAME}", url=f"https://t.me/{OWNER_USERNAME.replace('@', '')}")],
            [InlineKeyboardButton("◀️ Назад", callback_data='accept_offer')]
        ]
        reply_markup = InlineKeyboardMarkup(keyboard)
        
        await query.edit_message_text(
            text=DEMO_INVITATION_TEXT.format(owner_username=OWNER_USERNAME),
            parse_mode=ParseMode.HTML,
            reply_markup=reply_markup
        )
    
    elif action == 'buy_subscription':
        # Приглашение купить подписку в личке
        keyboard = [
            [InlineKeyboardButton(f"✉️ Написать {OWNER_USERNAME}", url=f"https://t.me/{OWNER_USERNAME.replace('@', '')}")],
            [InlineKeyboardButton("◀️ Назад", callback_data='accept_offer')]
        ]
        reply_markup = InlineKeyboardMarkup(keyboard)
        
        await query.edit_message_text(
            text=SUBSCRIPTION_INVITATION_TEXT.format(owner_username=OWNER_USERNAME),
            parse_mode=ParseMode.HTML,
            reply_markup=reply_markup
        )
    
    elif action == 'about_service':
        # Информация о сервисе
        about_text = """
<b>🤖 О GhostCopywriter</b>

<b>GhostCopywriter</b> — это AI-платформа нового поколения для создания профессионального контента для социальных сетей.

<b>🎯 Основные возможности:</b>
• Генерация текстов для 8+ платформ
• Автоматический подбор изображений
• Гибкая настройка тона, стиля, целей
• SEO-оптимизация контента
• Поддержка эмодзи и хештегов
• Адаптация под целевую аудиторию

<b>🤝 Кто мы:</b>
Команда разработчиков и маркетологов, создающая инструменты для эффективного контент-маркетинга.

<b>🚀 Миссия:</b>
Сделать профессиональный контент доступным каждому, автоматизировать рутинные задачи SMM-специалистов и помочь бизнесу эффективно общаться с аудиторией.

<b>📊 Статус:</b>
Сейчас проект в бета-версии. Мы активно дорабатываем функционал на основе обратной связи от первых пользователей.

<b>💬 Контакты:</b>
По всем вопросам: {owner_username}
"""
        
        keyboard = [
            [InlineKeyboardButton("◀️ Назад", callback_data='accept_offer')]
        ]
        reply_markup = InlineKeyboardMarkup(keyboard)
        
        await query.edit_message_text(
            text=about_text.format(owner_username=OWNER_USERNAME),
            parse_mode=ParseMode.HTML,
            reply_markup=reply_markup
        )


async def help_command(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    """Обработчик команды /help"""
    help_text = f"""
<b>🤖 GhostCopywriter — Справка</b>

<b>Доступные команды:</b>
/start - Начать работу (показать оферту)
/help - Показать эту справку
/offer - Показать публичную оферту
/privacy - Показать политику конфиденциальности
/contact - Контакты для связи

<b>Как получить доступ:</b>
1. Примите условия оферты
2. Выберите "Получить DEMO-доступ" или "Оформить подписку"
3. Напишите мне в личку: {OWNER_USERNAME}
4. Получите персональную ссылку для доступа

<b>💡 Вопросы?</b>
Пишите напрямую: {OWNER_USERNAME}
"""
    
    await update.message.reply_html(help_text)


async def offer_command(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    """Показать публичную оферту"""
    await update.message.reply_html(OFFER_PART_1)
    await update.message.reply_html(OFFER_PART_2)
    await update.message.reply_html(
        OFFER_PART_3.format(owner_username=OWNER_USERNAME)
    )


async def privacy_command(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    """Показать политику конфиденциальности"""
    await update.message.reply_html(
        PRIVACY_POLICY.format(owner_username=OWNER_USERNAME)
    )


async def contact_command(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    """Показать контакты"""
    contact_text = f"""
<b>📞 Контакты GhostCopywriter</b>

<b>Владелец проекта:</b>
Лавров Артем Сергеевич

<b>Telegram:</b>
{OWNER_USERNAME}

<b>По вопросам:</b>
• Получения DEMO-доступа
• Оформления подписки
• Технической поддержки
• Сотрудничества

пишите напрямую в Telegram!

<b>Время ответа:</b>
Обычно в течение 5-30 минут в рабочее время (10:00-22:00 МСК)
"""
    
    keyboard = [
        [InlineKeyboardButton(
            f"✉️ Написать {OWNER_USERNAME}", 
            url=f"https://t.me/{OWNER_USERNAME.replace('@', '')}"
        )]
    ]
    reply_markup = InlineKeyboardMarkup(keyboard)
    
    await update.message.reply_html(contact_text, reply_markup=reply_markup)


async def error_handler(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    """Обработчик ошибок"""
    logger.error(f"Ошибка при обработке обновления: {context.error}")
    
    if update and update.effective_message:
        await update.effective_message.reply_text(
            "❌ Произошла ошибка при обработке вашего запроса.\n"
            f"Пожалуйста, попробуйте позже или напишите напрямую: {OWNER_USERNAME}"
        )


def main():
    """Запуск бота"""
    logger.info("🚀 Запуск публичного бота GhostCopywriter...")
    
    # Создаем приложение
    application = Application.builder().token(BOT_TOKEN).build()
    
    # Регистрируем обработчики команд
    application.add_handler(CommandHandler("start", start_command))
    application.add_handler(CommandHandler("help", help_command))
    application.add_handler(CommandHandler("offer", offer_command))
    application.add_handler(CommandHandler("privacy", privacy_command))
    application.add_handler(CommandHandler("contact", contact_command))
    
    # Регистрируем обработчик callback'ов от inline кнопок
    application.add_handler(CallbackQueryHandler(button_callback))
    
    # Регистрируем обработчик ошибок
    application.add_error_handler(error_handler)
    
    # Запускаем бота
    logger.info("✅ Публичный бот успешно запущен!")
    logger.info(f"👤 Владелец: {OWNER_USERNAME}")
    logger.info("Нажмите Ctrl+C для остановки.")
    
    application.run_polling(allowed_updates=Update.ALL_TYPES)


if __name__ == '__main__':
    try:
        main()
    except KeyboardInterrupt:
        print("\n\n👋 Публичный бот остановлен пользователем. До свидания!\n")
    except Exception as e:
        logger.error(f"Критическая ошибка: {e}")
        sys.exit(1)
